BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega16U4.PIC
        <edc:SFRDef edc:_addr="0xCF" edc:access="nnnnnnnn" edc:cname="OCR4A" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR4A" edc:desc="Timer/Counter4 Output Compare A bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD0" edc:access="nnnnnnnn" edc:cname="OCR4B" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR4B" edc:desc="Timer/Counter4 Output Compare B bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="OCR4C" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR4C" edc:desc="Timer/Counter4 Output Compare C bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnn" edc:cname="OCR4D" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCR4D" edc:desc="Timer/Counter4 Output Compare D bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="nnnnnnnn" edc:cname="DT4" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DT4L" edc:desc="Timer/Counter 4 Dead Time Value Bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD5" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xD7" edc:access="-------n" edc:cname="UHWCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UVREGE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD8" edc:access="n-nn---n" edc:cname="USBCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUSTE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="OTGPADE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRZCLK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="USBE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD9" edc:access="----n--n" edc:cname="USBSTA" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDA" edc:access="-------n" edc:cname="USBINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUSTI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xDB" edc:offset="0x5"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="----nnnn" edc:cname="UDCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMWKUP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSM" edc:desc="USB low speed mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTCPU" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnn-n" edc:cname="UDINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSMI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSMI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnn-n" edc:cname="UDIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSME" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="UDADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UADD" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
